// Напишите программу, которая 
// 1. на вход принимает число и
// 2.  выдаёт его квадрат (число умноженное на само себя).

// Например:
// 4 -> 16
// -3 -> 9
// -7 -> 49
Console.WriteLine("Введите целое число: ");
int number = Convert.ToInt32(Console.ReadLine());
int square = number * number;
Console.WriteLine($"Квадрат числа {number} = {square}");

if (number == 1) System.Console.WriteLine();
else if (number == 2) System.Console.WriteLine();
else if (number == 3) System.Console.WriteLine();
else if (number == 1) System.Console.WriteLine();
else if (number == 1) System.Console.WriteLine();
else if (number == 1) System.Console.WriteLine();
else System.Console.WriteLine();


// int n = 113;
// int r = 113 / 10; // 113 / 100 = 1
// int r = 113 % 2; // 113 % 10 = 3